src/Catalogs/ОбъектыМетаданных/ОбъектыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданных</name>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>CatalogRef.ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноИзменениеВРабочихБазах</name>
    <comment>Дополнительный фильтр для отчета &quot;Контроль записи рабочих данных&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеВремяЗахватаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОтветственныеЛогическихПодсистем/ОтветственныеЛогическихПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛогическихПодсистем</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ЛогическаяПодсистема</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СоставЛогическихПодсистем/СоставЛогическихПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставЛогическихПодсистем</name>
  <resources>
    <name>ЛогическаяПодсистема</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ОбъектыМетаданных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.МаксимальноеВремяЗахватаЧасов.ПодсказкаВвода = Объект.Владелец.МаксимальноеВремяЗахватаПоУмолчаниюЧасов;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьЛогическуюПодсистему(Команда)
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ПослеВыбораЛогическойПодсистемы", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("УстановитьПользовательскийОтборПоТекущемуПользователю", Истина);
	ОткрытьФорму(
		"РегистрСведений.ОтветственныеЛогическихПодсистем.Форма.ФормаВыбора",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор,
		,
		,
		ОповещениеОВыборе,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораЛогическойПодсистемы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПослеВыбораЛогическойПодсистемыНаСервере(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеВыбораЛогическойПодсистемыНаСервере(Результат, ДополнительныеПараметры) Экспорт
	УстановитьЛогическуюПодсистемуОбъектамНаСервере(Результат);
КонецПроцедуры

&НаСервере
Процедура УстановитьЛогическуюПодсистемуОбъектамНаСервере(ЛогическаяПодсистема)

	// Создаём связь
	Попытка
		МЗ = РегистрыСведений.СоставЛогическихПодсистем.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДатаСеанса();
		МЗ.ОбъектМетаданных = Объект.Ссылка;
		МЗ.ЛогическаяПодсистема = ЛогическаяПодсистема;
		МЗ.Записать();
		ОбщегоНазначения.СообщитьПользователю("Связь объекта с подсистемой установлена.");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(
			"Не удалось установить логическую подсистему для объекта метаданных: "
			+ Объект.Ссылка
			+ " по причине: "
			+ ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
